# 练习:
#   写一个程序,打印一个高度为4行的矩形(rectangle)方框
#   要求:输入一个整数,此整数代表矩形宽度,输出此矩形
# k=int(input('请输入矩形宽度:'))
# print('#'*k)
# print('#'+' '*(k-2)+'#')
# print('#'+' '*(k-2)+'#')
# print('#'*k)

# 练习:
#   输入一个字符串,打印第一个和最后一个字符
#   如果字符串长度为偶数打印|
#   如果字符串长度为奇数打印中间那个字符
# s=input('请输入一个字符串:')
# print('第一个字符:'+s[0],
#     '\n'+'最后一个字符:'+s[-1])
# if len(s)%2==0:
#     print('|')
# else :
#     print('中间那个字符:'+s[(len(s)-1)//2])


# 练习:
#   回文判定
# s=input('输入一个字符串:')
# s1=s[::-1]
# if s==s1:
#     print('是回文')
# else :
#     print('不是回文')

# 练习:
#   1.输入一段字符串,若字符串不为空,则把第一个字符
#   的Unicode值打印出来
# s=input('输入:')
# if len(s)!=0:
#     print(s[0],'的编码是:',ord(s[0]))

#   2.输入一个整数值(0-65535),打印这个编码对应的字符
# num=int(input('请输入一个整数'))
# print(chr(num))

# 练习:
#   输入三行文字,让三行文字在一个方框内居中显示(非中文)
#  +-------------------+
#  |                   |
#  |                   |
#  |                   |
#  +-------------------+ 
# a1=input('please input statement 1:')
# a2=input('please input statement 2:')
# a3=input('please input statement 3:')
# a=[a1,a2,a3]
# b=max(len(a1),len(a2),len(a3))
# print('+'+'-'*(b+2)+'+')
# print('|'+' '*((b-len(a1)+2)//2)+a1+
#     ' '*((b+2)-(b-len(a1)+2)//2-len(a1))+'|')
# print('|'+' '*((b-len(a2)+2)//2)+a2+
#     ' '*((b+2)-(b-len(a2)+2)//2-len(a2))+'|')
# print('|'+' '*((b-len(a3)+2)//2)+a3+
#     ' '*((b+2)-(b-len(a3)+2)//2-len(a3))+'|')
# print('+'+'-'*(b+2)+'+')


 