#! /usr/bin/python3
# 练习:
#  一个学生毕业后月薪10000元,每年涨20%,十年后月薪?
# print('10000*1.2**10')

# 练习:
#   1.写程序在终端输出图形:
#   ########
#   #      #
#   #      #
#   ########
# print('#'*8)
# print('#'+' '*6+'#')
# print('#'+' '*6+'#')
# print('#'*8)

#   2.已知矩形长边为6cm,短边为4cm,求矩形周长和面积,并
#    打印在终端上
# a = 6
# b = 4
# print('周长为{}cm'.format((a+b)*2))
# print('面积为{}cm^2'.format(a*b))

# 练习:
#  1.在终端打印出图形
#       *
#      ***
#     *****
#    *******
# print(' '*4+'*')
# print(' '*3+'***')
# print(' '*2+'*'*5)
# print(' '*1+'*'*7)

#  2.古代秤是16两一斤,古代216两是现在几斤?
# a=216//16
# b=216%16
# print('是现在的{}斤{}两'.format(a,b))

#  3.凌晨0:0:0计时,到现在过去63320秒,现在是几时,几
#  分几秒
# c=63320
# d=c//3600
# e=(c-d*3600)//60
# f=c%60
# print('现在是{}时{}分{}秒'.format(d,e,f))


